// HW1_20231031.cpp : このファイルには 'main' 関数が含まれています。プログラム実行の開始と終了がそこで行われます。
//

#include <iostream>
using namespace std;

int main()
{
    int range = 0;
    int Number = 0;
    int count = 0;

    cout << "範囲を入力　＞　" << flush;
    cin >> range;

    for (int i = 1; i <= range; i += 2) {//割られる数
        count = 0;
        for (int j = 1; j <= i; j += 2) {//割る数
            if (i % j == 0) { ++count; }
            if (count > 8)break;
        }
        if (count == 8) ++Number;
    }

    cout << "約数をちょうど８個持つ数は " << Number << " 個です。";
}

// プログラムの実行: Ctrl + F5 または [デバッグ] > [デバッグなしで開始] メニュー
// プログラムのデバッグ: F5 または [デバッグ] > [デバッグの開始] メニュー

// 作業を開始するためのヒント: 
//    1. ソリューション エクスプローラー ウィンドウを使用してファイルを追加/管理します 
//   2. チーム エクスプローラー ウィンドウを使用してソース管理に接続します
//   3. 出力ウィンドウを使用して、ビルド出力とその他のメッセージを表示します
//   4. エラー一覧ウィンドウを使用してエラーを表示します
//   5. [プロジェクト] > [新しい項目の追加] と移動して新しいコード ファイルを作成するか、[プロジェクト] > [既存の項目の追加] と移動して既存のコード ファイルをプロジェクトに追加します
//   6. 後ほどこのプロジェクトを再び開く場合、[ファイル] > [開く] > [プロジェクト] と移動して .sln ファイルを選択します
